app/controllers/school_classes_controller.rb

def create
  @school_class = SchoolClass.create(post_params)
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Computer Science"], ["room_number", 5], ["created_at", "2018-11-30 01:35:12.034411"], ["updated_at", "2018-11-30 01:35:12.034411"]]

def update
  @school_class = SchoolClass.find_by_id(params[:id])
  @school_class.update(post_params)
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["room_number", 10], ["updated_at", "2018-11-30 03:00:20.169754"], ["id", 1]]