app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Bill"], ["last_name", "Smith"], ["created_at", "2018-11-30 02:19:42.065137"], ["updated_at", "2018-11-30 02:19:42.065137"]]
---
  def create
    @student = Student.create(post_params)

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["updated_at", "2018-11-30 03:22:32.619519"], ["id", 1]]
---
  def update
    @student = Student.find_by_id(params[:id])
    @student.update(post_params)